rails/app/controllers/play_controller.rb

SELECT `game_states`.* FROM `game_states` WHERE `game_states`.`id` = 1 LIMIT 1
SELECT `game_players`.* FROM `game_players` WHERE `game_players`.`state_id` = 1 AND (next_player_id IS NOT NULL)
SELECT `game_locations`.* FROM `game_locations` WHERE `game_locations`.`state_id` = 1
---
  def history
    game = Terra::GameState.find(params[:id])
    @history = {:events=>game.history_events(params[:after_turn].to_i)}
    unless params[:after_turn]
      @history[:originalPlayers] = (game.players - game.created_players).map{|q| q.to_hash}
      @history[:originalLocations] = (game.locations).map{|q| q.to_hash}